app/controllers/scores_controller.rb

  def index
    @scores = Score.all
---
SELECT "scores".* FROM "scores"

  def create
    @user = current_user
    @score = Score.new(score_params)
    @score.users.push(@user)
---
INSERT INTO "scores" ("created_at", "score", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-18 19:08:55.182794"], ["score", 4050], ["updated_at", "2014-12-18 19:08:55.182794"]]

    def set_score
      @score = Score.find(params[:id])
---
SELECT  "scores".* FROM "scores"  WHERE "scores"."id" = $1 LIMIT 1  [["id", 3]]